#   Tbilisi Comm School x GITA: Python
#   Lesson 3
#   Giorgi Goderdzishvili
#
#   გამოიყენე FOR ციკლი რომელიც მიწვდება data ყველა ელემენტს და დაწერე შემდეგი ლოგიკა,
#   თუ ელემენტი არის სტრინგი და შეიცავს მხოლოდ რიცხვს გადააქციე რიცხვად და შეინახე total-ში,
#   თუ რიცხვია პირდაპირ შეინახე total-ში, თუ სხვა ტიპის მონაცემთა ტიპია გამოტოვე.
#   ბოლოს დაბეჭდე სრული ჯამი.

data = ["5", 0, "3", True, "", 2, "x", False]
total = 0

# ვინაიდან ამოცანაში ტოტალი განსაზღვრულია ცვლადად, ვამატებ კიდევ ერთ სიას,
# პირობაში მითითებულია, რომ რიცხვები უნდა შევინახო ტოტალში, ცვლადში კიდევ ვერ ვინახავ
# თან ბოლოს უნდა დავბეჭდო ჯამი. ამიტომ სიაში შევინახავ და ცვლადში დავაჯამებ.
mylist = []

for i in data:  # გადავუაროთ სიას : მომიწია isinstance() გამოყენება. მადლობა ავტოშეთავაზებას და გუგლს :)
    if isinstance(i, str) and i.isdigit():  # შევამოწმოთ თუ არის სტრიქონი და ამავე დროს შეიცავს მხოლოდ რიცხვებს
        mylist.append(i)  # დავამატოთ სიაში
        total += int(i)  # დავაჯამოთ ცვლადში
    elif isinstance(i, (int, float)):  # შევამოწმოთ თუ არის წილადი ან რიცხვი
        mylist.append(int(i))  # დავამატოთ სიაში
        total += i  # დავაჯამოთ ცვლადში

print(mylist)
print(total)
