#   Tbilisi Comm School x GITA: Python
#   Lesson 3
#   Giorgi Goderdzishvili
#
#   პროგრამამ შემთხვევითი პრინციპით უნდა ჩაიფიქროს რიცხვი 1-დან 50-ის ჩათვლით
#   მომხმარებელმა უნდა შეიყვანოს საკუთარი ვარაუდი
#   დიაპაზონის გარეთ რიცხვის შეყვანისას უნდა ვთხოვოთ, რომ დაუბრუნდეს 1-50 დიაპაზონს
#   უნდა დავიმახსოვროთ მცდელობების რაოდენობა
#   გამოცნობის შემთხვევაში უნდა გამოვიტანოთ ჩაფიქრებული რიცხვის მინშვნელობა და მცდელობების რაოდენობა
#   exit შეყვანის შემთხვევაში დავასრულოთ თამაში

# ვიცი რომ ჯერ არ გაგვივლია, მაგრამ ხელით ჩაწერას და შემდეგ გამოცნობას, სჯობს შემთხვევითი რიცხვი ავიღოთ
import random

random_number = random.randint(1, 50)
total_try = 0

print("მოგესალმებით რიცხვების გამოცნობის თამაშში 🎲")
print("თქვენი მიზანია გამოიცნოთ კომპიუტერის ჩაფიქრებული რიცხვი 1-დან 50-ის ჩათვლით.")
print("მცდელობებში შეზღუდული არ ხართ, მაგრამ თუ თამაში მოგბეზრდათ,")
print("შეგიძლიათ აკრიფოთ ჯადოსნური სიტყვა \"exit\"")
print("ან გამოიძახოთ დახმარება. ამისთვის კი უნდა აკრიფოთ სიტყვა \"help\" ან ?")
print("·" * 28 + "\n")  # გავალამაზოთ მესიჯი

print("მაშ ასე, თუ მზად ხართ, შეგვიძლია თამაშის დაწყება!")
while True:  # დავიწყოთ თამაში
    user_input = input("გთხოვთ მიუთითოთ თქვენი ვარაუდი: ")
    if user_input.isdigit():
        digit = int(user_input)
        if digit > 0 and digit < 51:
            if digit > random_number:
                print("\nცოტა მეტი მოგივიდა, უფრო პატარა რიცხვი სცადე")
                total_try += 1
            elif digit < random_number:
                print("\nცოტა ნაკლები მოგივიდა, უფრო დიდი რიცხვი სცადე")
                total_try += 1
            else:
                total_try += 1
                print("\n🥳 გილოცავ! შენ ეს შეძელი 🎉🥂")
                print("ჩაფიქრებული იყო რიცხვი " + str(random_number) + ". გამოსაცნობად დაგჭირდა " + str(
                    total_try) + " მცდელობა")
                break

    elif user_input == "help" or user_input == "HELP":
        print("თქვენი მიზანია გამოიცნოთ კომპიუტერის ჩაფიქრებული რიცხვი 1-დან 50-ის ჩათვლით.")
        print("მცდელობებში შეზღუდული არ ხართ, მაგრამ თუ თამაში მოგბეზრდათ,")
        print("შეგიძლიათ აკრიფოთ ჯადოსნური სიტყვა \"exit\"")
        print("·" * 28 + "\n")  # გავალამაზოთ მესიჯი

    elif user_input == "exit" or user_input == "EXIT":
        print("მადლობა, თამაშისთვის. იმედია კარგად გაერთე 🤗")
        break

    else:
        print("😥 სამწუხაროდ, თქვენი მოთხოვნა \"" + user_input + "\" ჩვენთვის ბუნდოვანია.")
        print("გთხოვთ, თამაშის წესების გასაცნობად აკრიფოთ სიტყვა \"help\" ან ?")
