#   Tbilisi Comm School x GITA: Python
#   Lesson 3
#   Giorgi Goderdzishvili
#
#   გაქვთ ონლაინ მაღაზია, როდესაც მომხმარებელი შემოდის პროგრამის გაშვებისას უნდა
#   გამოუჩნდეს მენიუ მაგალითად: “გამარჯობა” თქვენ იმყოფებით მაღაზია SpaceX-ში, პროდუქტები:
#   რაკეტა - 15000$, ხომალდი - 25000$, ჩაფხუტი - 5000$ და ა.შ. მომხმარებელს უნდა ჰკითხოთ
#   რომელი ნივთები უნდა და დაუთვალოთ რა დაუჯდება ჯამურად, თუ დაგეთანხმებათ უნდა მიჰყიდოთ
#   ნივთები თუ უარს იტყვის შეთავაზებაზე უნდა დაასრულოთ მუშაობა.

# პროდუქტების სია ფასებით
products = {
    "რაკეტა": 15000,
    "ხომალდი": 25000,
    "ჩაფხუტი": 5000,
    "სკაფანდრი": 3000,
    "სატელიტი": 8000
}

cart = []  # არჩეული პროდუქტების სიის შესანახად
total_price = 0  # არჩეული პროდუქტების ჯამური ფასი

print("გამარჯობა 🚀")
print("კეთილი იყოს თქვენი მობრძანება მაღაზია SpaceX-ში!")
print("ხელმისაწვდომი პროდუქტებია:")

# დავბეჭდოთ პროდუქტების სია
i = 0
for product, price in products.items():
    print(str(i + 1) + ". " + product + ": " + str(price) + "$")
    i += 1

print("= - " * 11 + "= ")  # უბრალო ხაზი სილამაზისთვის

# გამოგვაქვს ზოგადი ტექსტი და ვიწყებთ ჯადოქრობას
print("\nრომელი ნივთის შეძენა გსურთ? (გთხოვთ, შეიყვანოთ ნივთის ნომერი)")
print("შეკვეთის დასასრულებლად აკრიფეთ \"checkout\"")
print("დახმარებისთვის ნებისმიერ დროს აკრიფეთ \"help\", ან ?")
print("ხოლო თუ პროგრამის მუშაობის შეწყვეტა გსურთ, აკრიფეთ \"exit\"")

while True:
    user_input = input("\nმიუთითეთ თქვენი არჩევანი: ")

    if user_input.isdigit():  # ვამოწმებთ, მომხმარებელმა პროდუქტის ნომერი შეიყვანა, თუ საკვანძო სიტყვა
        index = int(
            user_input) - 1  # ვინაიდან ინდექხი ნულიდან ითვლება და პროდუქტების ნუმერაცია ერთიდან. მომხმარებლის შეყვანილ მნიშვნელობას ვაკლებთ ერთს

        if 0 <= index < len(
                products):  # ვამოწმებთ, ჯდება თუ არა მომხმარებლის შეყვანილი რიცხვი პროდუქტების ინდექსის დიაპაზონში
            product_keys = list(products.keys())  # გადაგვყავს პროდუქტების ლექსიკონი ლისტში
            product_name = product_keys[index]  # ამოვიკითხოთ პროდუქტის დასახელება
            product_price = products[
                product_name]  # ამოვიკითხოთ პროდუქტის დასახელების შესაბამისი ფასი პროდუქტების ლექსიკონიდან
            total_price += product_price  # ვაჯამებთ ღირებულებას
            cart.append(
                product_name)  # ვიცი, რომ ეს არ გვისწავლია, მაგრამ ვამატებთ არჩეული პროდუქტის სახელს კალათის ლისტში
            print(f"თქვენ დაამატეთ {product_name}. ჯამური ფასი: {total_price}$")
        else:
            print(
                "თქვენ მიუთითეთ არასწორი ნომერი. გთხოვთ, ხელახლა გადახედოთ პროდუქტების სიას და შეიყვანოთ რიცხვი 1-დან " + str(
                    len(products)) + "-მდე")

    elif user_input == "checkout" or user_input == "CHECKOUT":
        print("·" * 28 + "\n")  # ვალამაზებთ ჩეკს
        print("თქვენ შეიძინეთ: " + str(cart))  # ჩამოვუწეროთ რას ყიდულობს
        print("თქვენ გადასახდელი გაქვთ: " + str(total_price) + "$")  # გავახაროთ საბოლოო ფასით
        print("·" * 28 + "\n")  # ვალამაზებთ ჩეკს
        print("🚀 მადლობა, რომ ისარგებლეთ SpaceX მომსახურებით.")
        print("იმედია მალე კვლავ დაგვიბრუნდებით ❤️")
        break

    elif user_input == "exit" or user_input == "EXIT":
        print("მადლობა, SpaceX-ში სტუმრობისთვის 🚀\nიმედია მალე კვლავ დაგვიბრუნდებით ❤️")
        break

    elif user_input == "?" or user_input == "help" or user_input == "HELP":
        print("სასურველი ნივთის შეკვეთების კალათში მოსათავსებლად გთხოვთ, შეიყვანოთ ნივთის ნომერი)")
        print("შეკვეთის დასასრულებლად აკრიფეთ \"checkout\"")
        print("ხოლო თუ პროგრამის მუშაობის შეწყვეტა გსურთ, აკრიფეთ \"exit\"")

    else:
        print("😥 სამწუხაროდ, თქვენი მოთხოვნა \"" + user_input + "\" ჩვენთვის ბუნდოვანია.")
        print("გთხოვთ მიუთითოთ სასურველი პროდუქტის ნომერი,")
        print("შეკვეთის დასასრულებლად აკრიფოთ \"checkout\",")
        print("ან თუ პროგრამის მუშაობის შეწყვეტა გსურთ, აკრიფოთ \"exit\"")
