#   Tbilisi Comm School x GITA: Python
#   Lesson 3
#   Giorgi Goderdzishvili
#
#   გამოითვალეთ თითოეული სტუდენტის საშუალო არითმეტიკული ქულა
#   და დააბრუნეთ მისთვის შესაფერისი ნიშანი

Students = {
    "ანა": [89, 66, 12, 75, 11],
    "გიორგი": [67, 72, 90, 91, 55],
    "ლევანი": [49, 36, 88, 98, 34],
    "ვერონიკა": [99, 88, 32, 65, 99],
    "ნიკა": [77, 81, 41, 73, 99]
}

print("მოსწავლეების საშუალო არითმეტიკული ქულის გამოსათვლელი სკრიპტი:\n")
for student_name, scores in Students.items():
    print(str(student_name) + ":\nწლის განმავლობაში მიღებული ქულებია " + str(scores)[1:-1])
    print("საშუალო მოსწრება შეადგენს: " + str(round(sum(scores) / len(scores), 2)) + " ქულას.\n")
