#   Tbilisi Comm School x GITA: Python
#   Lesson 5
#   Giorgi Goderdzishvili
#
#   ზედმეტსახელების გენერატორი

import random
nickname_dict = {
    "ცალტვინა": "თუ აზრი წინადადების ბოლომდე ვერ მიყვება.",
    "ზიდანა": "თუ თმა ნახევრად გასცვივდა.",
    "ბრაუნა": "თუ ზაფხულობით გოჭივით გარუჯვა უყვარს.",
    "ნაქსოვი": "თუ ტანზე იმდენი ბალანი აქვს, რომ ზამთარში სვიტრი არ სჭირდება.",
    "ძროხა": "თუ სუფრებზე მარტო ფხალეულს და მწვანილს ჭამს.",
    "მედუზა": "თუ თვალები გამჭვირვალე აქვს და ენა სუსხიანი.",
    "თოფილულა": "თუ ცვვირის ნესტოებს სანადირო თოფის ლულასავით ბერავს.",
    "კოდალა": "თუ კარგად აკაკუნებს ნერვებზე.",
    "ჩაწეული": "თუ ძალიან ხმადაბლა ლაპარაკობს.",
    "უკრაინა": "თუ ლოთობისგან თვალები ჩაყვითლებული აქვს და სახე გალურჯებული.",
    "წითელქუდა": "თუ ბებია მგელმა შეუჭამა.",
    "არკა": "თუ წინა კბილები არ აქვს.",
    "ორხელა": "ცალხელა სხვაა და რომ გავარჩიოთ.",
    "მლაშე": "თუ ზღვაში იხრჩობოდა და გადარჩა.",
    "ბერმუდა": "თუ სიმთვრალეში იკარგება.",
    "პროტესტანტი": "თუ ყველას მიტინგზე იდგა",
    "პუტინი": "თუ ყველა მეზობელთან ნაჩხუბარია.",
    "მიუნჰაუზენა": "თუ სულ ბაქიბუქობს და ტყუილები უყვარს.",
    "ნისია": "თუ უბნის ყველა მაღაზიაში ნისიების რვეულშია შეყვანილი.",
    "ძმარი": "თუ მჟავე იუმორი აქვს და შეწუხებული ღიმილი.",
    "კამათელი": "თუ პატარა და მრგვალია",
    "ხარაბუზა": "თუ ყველას აწუხებს და მწარედ იკბინება.",
    "გათანგული": "თუ დაბადებიდან დაღლილობაზე წუწუნებს.",
    "აინშტაინი": "თუ თავის მოფიქრებულს თვითონაც ვერ ხვდება",
    "ნაჯახი": "თუ დიპლომატიის ნასახი არ აქვს",
    "ერთგული": "თუ ყველა პარტიაშია ნამყოფი",
    "პაპლაოკა": "თუ ბევრჯერ იხრჩობოდა და გადარჩა",
    "გულადი": "თუ სიბნელის ეშინია"
}
dict_items_list = list(nickname_dict.items())
random_nicknames = random.sample(dict_items_list, 5)

print("მოგესალმებით მეტსახელების გენერატორში")
print("შეიყვანეთ სახელი და ჩვენ შევეცდებით კახური ტრადიციების დაცვით რაიმე სახალისო მეტსახელის შერჩევას")
input_name = input("შეიყვანეთ სახელი: ")
print(". " * 20)

print("საუკეთესო კახური ტრადიციების მიხედვით დავაგენერირეთ ხუთი მეტსახელი.\nშეარჩიეთ ყველაზე შესაფერი:\n")
for key, description in random_nicknames:
    print(f"{key} {input_name}")
    print(f"აღწერა: {description}\n")


