#   Tbilisi Comm School x GITA: Python
#   Lesson 4
#   Giorgi Goderdzishvili
#
#   დაწერეთ პირობა, რომელიც გაარკვევს შემოტანილი ასო არის თანხმოვანი თუ ხმოვანი

# იმისთვის, რომ გამერკვია ქართული და ინგლისური ხმოვნები, მომიწია თანხმოვნების დამატება და ლექსიკონად გაერთიანება
# თუმცა მეორე დღს რომ გადავხედე, მივხვდი, რომ უბრალოდ ერთ ცვლადში რომ ჩამეწერა ქართული და ინგლისური ხმოვნები,
# შედეგი პრაქტიკულად იგივე მექნებოდა. ნაკლებად მომხმარებელზე ორიენტირებული, მაგრამ ჩემთვისაც ნაკლებად საწვალებელი.

def check_vowels(char):
    abc = {
        "ინგლისური": {
            "ხმოვნები": "aeiou",
            "თანხმოვნები": "bcdfghjklmnpqrstvwxyz"
        },
        "ქართული": {
            "ხმოვნები": "აეიოუ",
            "თანხმოვნები": "ბგდვზთკლმნპჟრსტფქღყშჩცძწჭხჯჰ"
        }
    }

    # შევამოწმოთ ერთი ასო გადმოგვცეს, თუ მეტი, ან რამე სხვა
    if len(char) > 1:
        print("ამ ეტაპზე მე მხოლოდ ერთი ასოს შემოწმება შემიძლია")
        return

    # შესამოწმებელი ასო ყოველი შემთხვევისთვის, გადავიყვანოთ დაბალ რეგისტრში
    char_lower = char.lower()

    # გავარკვიოთ რომელ ენას ეკუთვნის და ხმოვანია თუ თანხმოვანი
    for lang, letters in abc.items():
        if char_lower in letters["ხმოვნები"]:
            print(f"\"{char}\" არის {lang} ხმოვანი.")
            return
        elif char_lower in letters["თანხმოვნები"]:
            print(f"\"{char}\" არის {lang} თანხმოვანი.")
            return

    # იმ შემთხვევებისთვის, თუ მითითებულია უცნობი ანბანი ან სპეცსიმბოლო
    if char.isalpha():
        print(f"სამწუხაროდ \"{char}\" არ არის ჩემთვის ცნობილი არცერთი ანბანის ასო.")
    else:
        print(f"შეყვანილი სიმბოლო \"{char}\" არ არის არცერთი ანბანის ასო.")


check_vowels(input("შეიყვანეთ შესამოწმებელი ასო: "))
