#   Tbilisi Comm School x GITA: Python
#   Lesson 4
#   Giorgi Goderdzishvili
#
#   დაწერეთ ფუნქცია რომელიც დაითვლის სიტყვების რაოდენობას წინადადებაში.
default = "ეს არის წინასწარ ჩაწერილი წინადადება, რომელშიც უნდა დადგინდეს სიტყვების რაოდენობა."


def word_stats(text):
    result = len(text.split())
    print(f"მასში არის {result} სიტყვა.")


print(
    "მე დავითვლი, რამდენი სიტყვაა თქვენ მიერ შეყვანილ წინადადებაში. \nან უბრალოდ დააჭირეო Enter-ს. ასეთ შემთხვევაში გამოვიყენებ ნაგულისხმევ ტექსტს.")
text = input("გთხოვთ შეიყვანოთ ტექსტი: ")

if text == "":
    text = default
    print(f"\nანალიზისთვის გამოვიყენე ნაგულისხმევი წინადადება: \"{text}\"")
else:
    print(f"\nანალიზისთვის მოცემული იყო წინადადება: \"{text}\"")

word_stats(text)
